                                
Internet Draft                                           Daichi Funato
draft-funato-seamoby-gaard-00.txt                          Xiaoning He
Expires: May 14, 2002                                    Carl Williams
                                                     Atsushi Takeshita
	                                               DoCoMo USA Labs

        Geographically Adjacent Access Router Discovery Protocol
                  <draft-funato-seamoby-gaard-00.txt >

Status of this Memo

This document is an Internet-Draft and is in full conformance with all
provisions of Section 10 of RFC2026.


Internet-Drafts are working documents of the Internet Engineering Task
Force (IETF), its areas, and its working groups.  Note that other
groups may also distribute working documents as Internet-Drafts.

Internet-Drafts are draft documents valid for a maximum of six months
and may be updated, replaced, or obsoleted by other documents at any
time.  It is inappropriate to use Internet-Drafts as reference material
or to cite them other than as ``work in progress.''

To view the list Internet-Draft Shadow Directories, see
http://www.ietf.org/shadow.html.

Distribution of this memo is unlimited.

The internet-draft will expire in 6 months.  The date of expiration
will be May 14, 2002.

Abstract

   This document describes a scheme (GAARD) that discovers geographically
   adjacent access routers (GAARs). This is accomplished through a 
   distributed process whereby all mobile hosts associated with the 
   current access router identify geographically adjacent access routers 
   by their corresponding Link-Layer beacons sent by geographically 
   adjacent access points. The Link-Layer identifiers are pushed to a 
   cache located on current access router. The GAARD scheme then specifies
   a mechanism whereby the current access router resolves the Link-Layer
   to IP Layer mapping for the geographically adjacent access routers.
   In this respect the mobile hosts function as sensors for identifying
   GAARs in order to provide information critical to the current access
   router and mobile host's capability to perform seamless IP-level
   handovers, such as fast handover and context transfer. The GAARD
   cache has the effect of providing information about the current
   access router surroundings not only to all the mobile hosts attached
   to the current access router, but also to those mobile hosts 
   that may become attached in the future.


Funato        Expires May 14, 2002                [Page 1]

Internet-Draft            GAARD                       November 2001

Table of Contents

1.  Introduction.................................................... 3
2.  Terminology..................................................... 4
3.  Protocol Overview............................................... 4
4.  Proxy Router Solicitation and Advertisement Process............. 5
    4.1 Mobile Host and Current Access Router Process............... 5
      4.1.1 Mobile Host............................................. 6
      4.1.2 Current Access Router................................... 6
    4.2 Proxy Router Solicitation................................... 6
    4.3 Proxy Router Advertisement.................................. 8
    4.4 Discussion............................... ................. 11
    4.5 Optional Fields Format..................................... 11
      4.5.1 Link-Layer Address Field............................... 11
      4.5.2 Prefix Information..................................... 13
      4.5.3 Cache Update Field..................................... 14
    4.6 GAARD Address Resolution for IPv4.......................... 15
    4.7 GAARD Address Router Cache................................. 16
      4.7.1 Optional Field Format.................................. 16
5.  GAARD SLP Process.............................................. 17
6.  Security ...................................................... 18
7.  References..................................................... 18
8.  AuthorsÆ Addresses............................................. 19
9.  Acknowledgements............................................... 20
10. IPR Statement.................................................. 20







Funato        Expires May 14, 2002                [Page 2]

Internet-Draft            GAARD                       November 2001


1. Introduction

   In a mobile network, handover occurs when a mobile host moves from
   the current Access Point (AP) to the geographically adjacent access
   point. For each geographically adjacent access point, the
   corresponding access  router (AR) is defined as a Geographically
   Adjacent Access Router (GAAR) even if the access router is located
   in a logically distant subnet. 

   For real-time mobile applications, a smooth and fast handover is
   critical. Furthermore, for most fast hand-over schemes, it is
   important for both the Mobile Host (MH) and the current access
   router to be aware of the identity of its GAAR.

   One existing approach is to manually configure this geographical
   neighborhood at each AR.  However, such an approach requires
   precise wireless coverage planning and it may not be feasible in
   some cases, such as WLAN hot spot support. Another approach is
   based on special location information system such as GPS (Global
   Positioning System). GPS based system can provide information to
   AP and MH with candidates of geographically adjacent APs. 
   However, the GPS is not always available. 

   Due to these facts, it is clear that an automatic and dynamic
   mechanism is required to discover GAARs without much administrative
   intervention. GAARD protocol provides that kind of discovery
   mechanism. In the rest of this document, the GAARD protocol
   is presented. 

   The GAARD protocol is a pre-movement or an "anticipated" protocol
   in the sense that a mobile host can get useful information about
   the potential next access router, e.g. IP address and prefix, 
   from a Link-Layer id. The GAARD allows the mobile host or the
   current AR to decide with which access router it will register.
   As a result, the GAARD is able to provide a seamless handoff
   to the mobile host.

   In the GAARD, the mobile host acts as a sensor in surrounding
   wireless environments. If a mobile host can simultaneously listen
   to multiple APs' Link-Layer id, the GAARD protocol is able to work
   in a heterogeneous environment. As a result, the access router
   is able to quickly have a complete knowledge about its adjacent
   access routers.

   Funato        Expires May 14, 2002                [Page 3]

Internet-Draft            GAARD                       November 2001

   The keywords MUST, MUST NOT, MAY, OPTIONAL, REQUIRED, RECOMMENDED,
   SHALL, SHALL NOT, SHOULD, SHOULD NOT are to be interpreted as defined
   in [KEYWORDS].

2. Terminology

   -Access Point (AP)
     
    A radio transceiver by which an MN obtains Link-Layer connectivity
    with the wired network.

   -Access Router (AR)

   An IP router residing in an access network and connected to
   one or more APs. An AR offers IP connectivity to MN.

   -Geographically Adjacent AR (GAAR)

    An AR whose coverage area is such that an MN may move from
    the coverage area of the AR currently serving the MN into the
    coverage area of this AR. In other words, GAARs have APs whose
    coverage areas are geographically adjacent or overlap.

3. Protocol Overview

                             ~~~~~~~~~~~                       
                            {           }                    
                           {             }                    
               +--------->{    IP Cloud   }-----------+                   
   GAARD SLP   |+----------{             }<----------+|          
    Service    || GAARD     {           }            || 
    Request    ||  SLP       ~~~~~~~~~~~             ||
               |V Service Reply                      |V
           +---------+                           +---------+
           | Current |                           |  Next   |
           |   AR    |                           |   AR    |
           +---------+                           +---------+
               ^|                                   |     |
      Proxy    ||  Proxy                            |     |  
      Router   ||  Router                           |     | 
  Solicitation |V Advertisement                  +---+ +---+    
        +--------------+       L2 id          +--|AP1| |AP2|     
        |    Mobile    |<---------------------+  +---+ +---+     
        |     Host     |<--------------------------------| 
        +--------------+       L2 id

                       Figure.1 GAARD Protocol

             
Funato        Expires May 14, 2002                [Page 4]

Internet-Draft            GAARD                       November 2001

In short, the GAARD protocol intends to allow a mobile host to
resolve the IP address and prefix of the GAAR across different
subnets based on a Link-Layer id within the beacon broadcasted
by the access point connected to GAAR. Since the protocol such
as RARP or Inverse Neighbor Discovery can only resolve the IP
address within a subnet, it is necessary to develop a protocol
such as the GAARD protocol presented in this draft to resolve
the IP address based on Link-Layer id across multiple subnets.

In GAARD protocol, each access point MUST be able to broadcast
a Link-Layer beacon which MUST contain a unique Link-Layer id.
The mobile host MUST be able to listen to these Link-Layer beacons 
simultaneously. When the Mobile Host receives the Link-Layer id
carried in the beacons, it sends the Proxy Router Solicitation
message carrying this Link-Layer id to its current access router.
In this darft , the access point is considered as an extended
interface of the access router.

At each access router, a GAARD cache defined in section 4.5
should be maintained. Each cache entry contains the Link-Layer
id and the IP addresses associated with this id. 

After the current access router received the Proxy Router
Solicitation message which contains a Link-Layer id, if the IP address
associated with this Link-Layer id is found in the GAARD
cache located at the current access router, the current access router 
must format a Proxy Router Advertisement message and sent back to
the Mobile Host. Otherwise, the GAARD protocol will attempt to
resolve the IP address first. As defined in section 5, the Service
Location Protocol(SLP) [SLP] is used to resolve the IP address based
on the Link-Layer id across multiple subnets. 
	
4. Proxy Router Solicitation and Advertisement Process

4.1 Mobile Host and Current Access Router Process

   For the different IP versions, the messages between Mobile Host 
   and current Access Router are extension of different protocols.
   For IPv6, the messages are defined as the extensions of Fast 
   Mobile IPv6 [FMIPv6] Proxy Router Solicitation/Advertisement
   [FMIPv6,IPv6] in section 4.2 and 4.3. 
   
Funato        Expires May 14, 2002                [Page 5] 

Internet-Draft            GAARD                       November 2001

4.1.1 Mobile Host

   When a mobile host receives a new Link-Layer id, it first searches 
   the local GAARD cache maintained at itself. If the IP address associated 
   with this Link-Layer id can not be found, the mobile host MUST
   format a Proxy Server Solicitation message as defined in
   section 4.2 and sends it to the current access router. When the
   current access router sends back the GAARD Proxy Router 
   Advertisement message which contains the IP addresses associated
   with the Link-layer id, the mobile node may add or update this
   information in its cache to facilitate the later use. If a GAARD
   cache is maintained at the mobile host, the mobile host MUST be
   able to process the Cache Update messages as defined in
   section 4.5.1.

4.1.2 Current Access Router

   After receives a Proxy Router Solicitation message, the
   current access router first checks the Sub-Type field of
   Link-layer Addresses (LLA) field. If this field is set to NULL,
   the access router MUST send back the whole cache to the mobile
   host in a GAARD Proxy Router Advertisement message. 

   If the LLA field is set to be NULL and Sub-Type field 
   is not NULL, the access router MUST 
   send all the cache entries which have the same Link-Layer Type
   as indicated in Sub-Type field back to Mobile Host.   
 
   If the LLA filed is not NULL and the IP address associated with
   the LLA is found in the cache, the access router MUST format
   a GAARD Proxy Router Advertisement message and send it back
   to the Mobile Host. 

   If the IP address associated with the LLA can not be found in
   the cache, the GAARD SLP process defined in section 5 MUST be
   performed. 

4.2 Proxy Router Solicitation 

   A Mobile Host sends a Proxy Router Solicitation message 
   which MUST carry the Link-Layer id obtained from Link-Layer's
   beacon to its current access router. 

Funato        Expires May 14, 2002                [Page 6]   

Internet-Draft            GAARD                       November 2001

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |     Code      |          Checksum             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |          Identifier           |           Reserved            |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |   Options ...
      +-+-+-+-+-+-+-+-+-+-+-+-

    IP Fields:

       Source Address
                      An IP address of the Mobile Host

       Destination Address
                      The address of the current Access Router

       Hop Limit      255

       Authentication Header
                      If a Security Association for the IP Authentication
                      Header exists between the sender and the
                      destination address, then the sender SHOULD include
                      this header.
       ICMP Fields:
 
        Type           TBD
  
        Code           0

        Checksum       The ICMP checksum.  See [ICMPv6].

        Identifier     MUST be set by the sender so replies can be matched
                       to this Solicitation.

        Reserved       MUST be set to zero by the sender and ignored by
                       the receiver.

   Required options:

   The sender node MUST send one or more following options in the
   GAARD Proxy Router Solicitation message:
   
   
Funato        Expires May 14, 2002                [Page 7]   

Internet-Draft            GAARD                       November 2001


       Target link-layer address field
                      The link-layer address field of the access router whose 
                      IP address will be resolved, if known. The format of 
                      this field is defined in section 
                      
   
   Other valid options:

   Future versions of this protocol may add other option types.
   Receivers MUST silently ignore any options they do not recognize and
   continue processing the message.

4.3 Proxy Router Advertisement

   After received a Proxy Router Solicitation message, the
   current access router replies with the Proxy Router
   Advertisement.

   If the Sub-Type filed of Target link-layer address field
   in the Proxy Router Solicitation message is 0,
   the access router MUST send back all the cache entries
   back to the mobile Host.

   If the LLA in the Target link-layer address field is set to be 0
   and Sub-Type field is not 0, the access router MUST 
   send all the cache entries which have the same Link-Layer Type
   as indicated in Sub-Type Type filed of the Proxy Router 
   Advertisement message back to Mobile Host.   

   If both the LLA field and Sub-Type fields in the Proxy Router
   Solicitation message are not NULL and
   a cache entry is found which contains the IP addresses associated
   with the Link Layer id carried in the Proxy
   Router Solicitation message or the SLP Process as
   defined in Section 5 is successfully being performed,
   the access router MUST send back this cache entry to
   the Mobile Host.
   
Funato                   Expires May 14, 2002              [Page 8]   

Internet-Draft            GAARD                       November 2001

  
   The Proxy Router Advertisement message is defined as an
   extension of the FMIPv6 Proxy Router Advertisement: 

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |     Code      |          Checksum             |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |          Identifier           |           Reserved            |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |   Options ...
      +-+-+-+-+-+-+-+-+-+-+-+-

    IP Fields:

       Source Address
                      The address of current access router

       Destination Address
                      The address of mobile host

       Hop Limit      255

       Authentication Header
                      If a Security Association for the IP Authentication
                      Header exists between the sender and the
                      destination address, then the sender SHOULD include
                      this header.

     ICMP Fields:

       Type           TBD

       Code           0  Handover Information
                      1  No change of COA required
                      128 New Attachment Point not known

       Checksum       The ICMP checksum.  See [ICMPv6].

       Identifier     Copied from Router Solicitation for Proxy or set to
                      Zero if unsolicited.

       Reserved       MUST be set to zero by the sender and ignored by
                      the receiver.
                      
Funato        Expires May 14, 2002                [Page 9]   

Internet-Draft            GAARD                       November 2001

    Required options:

    The sender node MUST send following options in the GAARD
    Proxy Router Advertisement message:
  
    Link-layer address

                      The link-layer id of the access router which the 
                      mobile host tries to resolve the IP address.
                      
    Prefix Information
   
                      These options specify the IP address and prefix 
                      associated with the link-layer id.

    Note that if the mobile host set the Sub-Type field or LLA field to NULL,
    the Proxy router solicitation will carry multiple Link-Layer address
    and Prefix Information field pair in a single Proxy Router Solicitation
    message.
   
    Other valid options:

    The format of this filed in defined in Section 4.4.

    The sender node MAY choose to add the following option in the
    Advertisement message:
   
      New COA Option

                      In stateful configuration, this option MUST be sent
                      to allocate an address on behalf of the Access
                      Router this message is proxied for (i.e.: the new
                      access router). In stateless address auto-
                      configuration this option may or may not be sent.

                      If sent, indicates that the requesting node SHOULD
                      use this address as new care-of-address for the
                      duration of the handover. If not sent the
                      requesting node SHOULD compute the new care-of-
                      address using the Interface ID from the Destination
                      Address of this message.
                                      
      Cache Update
        	     
        	      Cache Update actions used to keep the GAARD at the 
        	      
Funato        Expires May 14, 2002                [Page 10]   

Internet-Draft            GAARD                       November 2001

        	      Mobile Host synchronized with the GAARD cache
        	      at the access router.
        	   
   Future versions of this protocol may add other option types.
   Receivers MUST silently ignore any options they do not recognize
   and continue processing the message.


4.4 Discussion

   In section 4.2 and 4.3, the Proxy Router Solicitation/Advertisement messages
   are being used. However, different from usage of Proxy Router 
   Solicitation/Advertisment message in the FMIPv6, in GAARD, the some optional 
   fields are mandatory.
   
   Also, a new optinal field, i.e. Cache Update is defined.


4.5 Optional Fields Format 

4.5.1 Link-layer Addresses Filed

    This extension is based on the [MIER] format.
   
       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     |   Sub-Type    |     LLA ...
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

     Fields:

       Type
            TBD

       Length
           The length of the option (including the type, sub-type and
           length fields) in units of 8 octets.

Funato        Expires May 14, 2002                [Page 11]   

Internet-Draft            GAARD                       November 2001


       Sub-Type
            0  Get whole cache from the current access router
            1  for the Link-layer Address of the new Attachment Point.
            2  for the Link-layer Address of the Mobile Node.
            3  for the Link-layer Address of the Proxied Originator
          TBD  for the link-layer id identifying the access technology,
               e.g. 802.11

       LLA
           The variable length link-layer id or address.
           The content and format of this field (including byte and bit
           ordering) is expected to be specified in specific documents
           that describe how IPv6 operates over different link layers.

       Description
           The New Attachment Point Link Layer address contains the
           link-layer address of the attachment point the mobile node
           attempts to handover to. This is used in the Router
           Solicitation for Proxy message.

           The Mobile Node Link-Layer address option contains the link-
           layer address of a mobile node.  It is used in the Handover
           Initiation message.

           The Proxied Originator Link-Layer address option contains the
           Link Layer address of the Access Router the Proxy Router
           Solicitation message refers to.

           These options MUST be silently ignored for other Neighbor
           Discovery messages.

    NOTE: Source and Target Link Layer Addresses as defined in [ND] MAY
    also be used by Router Solicitation for Proxy and Proxy Routing
    Advertisement messages.

      
Funato        Expires May 14, 2002                [Page 12]   

Internet-Draft            GAARD                       November 2001

4.5.2.  Prefix Information

       0                   1                   2                   3
       0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |     Type      |    Length     | Prefix Length |L|A| Reserved1 |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                         Valid Lifetime                        |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                       Preferred Lifetime                      |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                           Reserved2                           |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
      |                                                               |
      +                                                               +
      |                                                               |
      +                            Prefix                             +
      |                                                               |
      +                                                               +
      |                                                               |
      +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Fields:

      Type           TBD

      Length         4

      Prefix Length  8-bit unsigned integer.  The number of leading bits
                     in the Prefix that are valid.  The value ranges
                     from 0 to 128.

      L              1-bit on-link flag.  When set, indicates that this
                     prefix can be used for on-link determination.  When
                     not set the advertisement makes no statement about
                     on-link or off-link properties of the prefix.  For
                     instance, the prefix might be used for address
                     configuration with some of the addresses belonging
                     to the prefix being on-link and others being off-
                     link.

      A              1-bit autonomous address-configuration flag.  When
                     set indicates that this prefix can be used for
                     autonomous address configuration as specified in
                     [ADDRCONF].

Funato        Expires May 14, 2002                [Page 13]   

Internet-Draft            GAARD                       November 2001

      Reserved1      6-bit unused field.  It MUST be initialized to zero
                     by the sender and MUST be ignored by the receiver.

      Valid Lifetime
                     32-bit unsigned integer.  The length of time in
                     seconds (relative to the time the packet is sent)
                     that the prefix is valid for the purpose of on-link
                     determination.  A value of all one bits
                     (0xffffffff) represents infinity.  The Valid
                     Lifetime is also used by [ADDRCONF].

      Preferred Lifetime
                     32-bit unsigned integer.  The length of time in
                     seconds (relative to the time the packet is sent)
                     that addresses generated from the prefix via
                     stateless address autoconfiguration remain
                     preferred [ADDRCONF].  A value of all one bits
                     (0xffffffff) represents infinity.  See [ADDRCONF].

      Reserved2      This field is unused.  It MUST be initialized to
                     zero by the sender and MUST be ignored by the
                     receiver.

      Prefix         An IPaddress. The first Prefix Length many bits of
                     this address contains the prefix information for
                     this address.
                     
4.5.3 Cache Update Field

  When a cache entry at the access router has been changed or deleted,
  the GAARD Cache Update message MUST be broadcasted.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |     Code      |          Length               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   | AC|                       Reserved                            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |   Options ...
   +-+-+-+-+-+-+-+-+-+-+-+-

Funato        Expires May 14, 2002                [Page 14]   

Internet-Draft            GAARD                       November 2001


   Fields:

      Type         TBD

      Code         0

      Length       The Length of the cache update message

      AC           Action of the Update 
                   0 Update an entry
                   1 Remove an entry 

      Reserved     32-bit unused field.  It MUST be initialized to
                   zero by the sender and MUST be ignored by the
                   receiver.
                   
   Required options:

      TBD  
        
   Other valid options:

      TBD
      
   Future versions of this protocol may add other option types.
   When the AC filed is set to be 0, the Mobile Host MUST update the
   entry with the information carried in the GAARD Cache Update message.
   When the AC filed is set to be 1, the Mobile Host MUST remove
   the entry. 

4.6 GAARD Address Resolution for IPv4
   
   TBD   



Funato        Expires May 14, 2002                [Page 15]   

Internet-Draft            GAARD                       November 2001


4.7 GAARD Access Router Cache

   Each GAARD access router MUST maintain a cache table. Each entry
   in the cache table has the follow format:

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Version   |    Length   |         Lifetime                |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                             LLA                               +
   |                                                               | 
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                                                               +
   |                                                               |
   +                            IP Address                         +
   |                                                               |
   +                                                               +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   +                 One or More Optional Fields                   +
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

    
  
  The cache entry SHOULD be periodically updated and broadcasted.
  In order to keep the cache synchronized, when the cache entry in the
  access router. When a cache entry in the access router has been
  changed or deleted, the access router MUST format a GAARD Cache
  Update message and broadcast this message. 

4.7.1 Optional Field Format

   The optional fields allow the access router to put extra information
   to assist the mobile host in the handover. 

   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |           Reserved            |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                            Value                              |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type             Type of the value
 
Funato        Expires May 14, 2002                [Page 16]  

Internet-Draft            GAARD                       November 2001 
   
                                               
   Length           The length of the option (including the Type,
                    Length, and the Reserved fields) in units of 8
                    octets. 

   Reserved         This field is unused.  It MUST be initialized to
                    zero by the sender and MUST be ignored by the
                    receiver.
 

5. GAARD SLP Process

In order to resolve the GAAR's IP address across multiple subnets,
the Service Location Protocol (SLP) can be used in the GAARD protocol. 
Inter-Administrative Domain Discovery is not covered in this draft
and may be covered in the following drafts.

At each access router, a list which contains the Link-Layer id of the 
access points connected to it MUST be maintained. If a SLP DA is
deployed, the access router MUST format and send a service
registration message (ServReg) which contains both IP address of the
access router and the Link-Layer id list to the Directory Agent (DA)
in its scope periodically. If there is no deployed DA, the access
router MUST function as a SLP Service Agent (SA) and service any
queries for the reverse address resolution.

After the access router receives the Proxy Router Solicitation
message from the mobile host and if the IP address associated with the
Link-Layer id is not found in the cache, the access router MUST format
a Service Request (ServReq) message which queries the IP addresses
associated with the Link-Layer id.

For example, when the current access router has to resolve the IP
address associated with the Link-Layer id = XXXX, it MUST function as
a SLP User Agent (UA) and format and send the following ServReq message

       <service:gaard;(link-layer-id=XXXX)>

After receiving the Service Request message mentioned above, either the
DA or the access router which is a SLP SA in conformance with the
SLP specification MUST reply with a Service Reply message. 

For example, the access router who is connected to the access point
with Link-Layer-id is XXXX must send back the Service Reply message
shown as follows

	<service:gaard://(host);link-layer-id=XXXX;ipaddr=YYYY>
	
Funato        Expires May 14, 2002                [Page 17]  

Internet-Draft            GAARD                       November 2001 


Another example is that the access router may send back the Service
Reply message shown as follows

<service:gaard://(host);link-layer-id=XXXX;ipaddr=YYYY;ip_network_prefix=ZZZZ>

In this case, the access router not only sends back the IP address of the
access router, but also send back the network prefix of the access
router's network. This example shows that the GAARD is flexible and
be able to provide useful information to assist the mobile node. 

This is only a brief overview of how SLP is used in GAARD protocol to
achieve cross subnet address resolution. A similar process is used in
IAPP [IAPP]. The new SLP templates and attributes defined for the GAARP will
be described in other drafts. 

6. Security 

There are several security related issues associated with the GAARD
which will be addressed in the revisions of this draft.


7. References

   [IPv6]        Deering, S. and R. Hinden, "Internet Protocol Version 6
                 Specification", RFC 2460, December 1998.

   [MIER]        Khalil, M., Narayanan, R., Akhtar, H., Qaddoura, E., 
                 "Mobile IP Extensions Rationalization (MIER)",
                 Work in progress, December 1999.

    
   [ICMPv6]      Conta, A., and S. Deering "Internet Control Message
                 Protocol for the Internet Protocol Version 6", RFC
                 2463, December 1998.

   [KEYWORDS]    Bradner, S., "Key words for use in RFCs to Indicate
                 Requirement Levels", BCP 14, RFC 2119, March 1997.
                 
   [SLP]         Guttman, E., Perkins, C., Veizades, J, Day, M., "Service
                 Location Protocol, Version 2", RFC 2608, June 1999.
                 
   [IAPP]        IEEE Std 802.11f/D2.0, "Draft Recommended Practice for
                 Multi-Vendor Access Point Interoperability via an
                 Inter-Access Point Protocol Across Distribution Systems
                 Supporting IEEE 802.11 Operation ", July 2001
                 
Funato        Expires May 14, 2002                [Page 18]   

Internet-Draft            GAARD                       November 2001

                 
   [L2REQ]       Kempf, J., Funato, D., Malki, K., Gwon, Y., Pettersson, M.
                 Reoberts, P., Soliman, H., Takeshita, A., Yegin, A., 
                 " Requirements for Layer 2 Protocols to Support
                 Optimized Handover for IP Mobility ", Working in Progress
                 
   [FMIPv6]      Dommety, G., Yegin, A., Perkins, C., Tsirtsis, G.,
                 El-Malki, K., Khalil, M., " Fast Handovers for Mobile
                 IPv6 ", Work in Progress, July 2001.
                
8. Authors' Addresses

   Daichi Funato
   DoCoMo Communications Laboratories USA, Inc.
   181 Metro Drive, Suite 300
   San Jose, CA 95110
   USA

   Phone: +1 408-451-4736
   EMail: funato@docomolabs-usa.com

   Xiaoning He
   DoCoMo Communications Laboratories USA, Inc.
   181 Metro Drive, Suite 300
   San Jose, CA 95110
   USA

   Phone: +1 408-451-4737
   EMail: xiaoning@docomolabs-usa.com

   Carl Williams
   DoCoMo Communications Laboratories USA, Inc.
   181 Metro Drive, Suite 300
   San Jose, CA 95110
   USA

   Phone: +1 408-451-4741
   EMail: carlw@docomolabs-usa.com
 
   Atsushi Takeshita
   DoCoMo Communications Laboratories USA, Inc.
   181 Metro Drive, Suite 300
   San Jose, CA 95110
   USA

   Phone: +1 408-451-4705
   EMail: takeshita@docomolabs-usa.com

Funato        Expires May 14, 2002                [Page 19]   

Internet-Draft            GAARD                       November 2001  

9. Acknowledgements

Thanks to James Kempf and Alper Yegin, DoCoMo USA Labs,
for reviewing the SLP protocol and FMIPv6.
We also thank Fujio Watanabe, DoCoMo USA Labs,
for his consultation on IEEE 802.11 protocols. 

10. IPR Statement

Copyright (C) The Internet Society (2001). All Rights Reserved.

DoCoMo Communications Laboratories USA, Inc. (DoCoMo USA Labs) hereby
declare that we are in conformity with Section 10 of RFC 2026.
Contributions of DoCoMo USA Labs may contain one or more patents or
patent applications. To the extent that the contribution of DoCoMo USA
Labs is adopted to the specification, DoCoMo USA Labs undertakes to
license patents technically necessary to implement the specification
on fair, reasonable and nondiscriminatory terms based on recipprocity.

This document and translations of it may be copied and furnished to
others, and derivative works that comment on or otherwise explain it or
assist in its implementation may be prepared, copied, published and
distributed, in whole or in part, without restriction of any kind,
provided that the above copyright notice and this paragraph are included
on all such copies and derivative works. However, this document itself
may not be modified in any way, such as by removing the copyright notice
or references to the Internet Society or other Internet organizations,
except as needed for the purpose of developing Internet standards in
which case the procedures for copyrights defined in the Internet
Standards process must be followed, or as required to translate it into
languages other than English.

The limited permissions granted above are perpetual and will not be
revoked by the Internet Society or its successors or assigns.

This document and the information contained herein is provided on an "AS
IS" basis and THE INTERNET SOCIETY AND THE INTERNET ENGINEERING TASK
FORCE DISCLAIMS ALL WARRANTIES, EXPRESS OR IMPLIED, INCLUDING BUT NOT
LIMITED TO ANY WARRANTY THAT THE USE OF THE INFORMATION HEREIN WILL NOT
INFRINGE ANY RIGHTS OR ANY IMPLIED WARRANTIES OF MERCHANTABILITY OR
FITNESS FOR A PARTICULAR PURPOSE.



Funato        Expires May 14, 2002                [Page 20]